[
    {
        "description": "A Trojan:Win32/Occamy.CEA malware has been detected on the system. This is a high severity threat, and immediate action is required.",
        "ip": "192.168.2.77",
        "action": "isolatenetwork, banbadip",
        "badip": "192.168.2.77",
        "baduser": "NT AUTHORITY\\SYSTEM"
    },
    {
        "description": "A high severity event has been detected. Windows Defender has identified a Trojan:Win32/Injector on the system. This malware poses a serious threat to the network and may lead to data theft, unauthorized access, and other malicious activities.",
        "ip": "192.168.2.77",
        "action": "isolatenetwork, banbadip",
        "badip": "192.168.2.77",
        "baduser": "NT AUTHORITY\\SYSTEM"
    },
    {
        "description": "High severity malware detected: VirTool:Win32/Injector on host Jossovich",
        "ip": "192.168.2.77",
        "action": "isolatenetwork",
        "baduser": "NT AUTHORITY\\SYSTEM"
    },
    {
        "description": "Windows Defender detected malware or potentially unwanted software (PUA:Win32/Creprote) on the system. The event occurred on the local computer and was detected by real-time protection. The affected files are located in the C:\\metasploit folder.",
        "ip": "192.168.2.77",
        "action": "isolatenetwork",
        "badip": "",
        "baduser": ""
    },
    {
        "description": "High severity SIEM alert: Windows Defender detected malware (PUA:Win32/Creprote) on a local computer. The malware was detected in real-time and has a high severity rating.",
        "ip": "192.168.2.77",
        "action": "isolatenetwork, banbadip",
        "badip": "192.168.2.77"
    },
    {
        "description": "Windows Defender detected malware or potentially unwanted software on the system. The threat is severe and categorized as potentially unwanted software. The detection source is real-time protection.",
        "ip": "192.168.2.77",
        "action": "isolatenetwork",
        "baduser": "NT AUTHORITY\\SYSTEM"
    },
    {
        "description": "High severity SIEM alert. Windows Defender detected malware or other potentially unwanted software on host Jossovich. Name: PUA:Win32/Creprote. Severity: Serious. Category: Potentially unwanted software. Detection source: Real-time protection.",
        "ip": "192.168.2.77",
        "action": "isolatenetwork",
        "badip": "",
        "baduser": ""
    }
]